Repository: zefr0x/hashes
Catalog: po/*.po
Languages: it, ru, zh_cn

source: Hashes
ru: Хэши
zh_cn: 哈希

source: Identify hashing algorithms
it: Identificare gli algoritmi di hashing
ru: Идентифицируйте алгоритмы хэширования
zh_cn: 检测哈希算法

source: Hash Identifier
it: Identificatore hash
ru: Идентификатор хэшей
zh_cn: 哈希标识符

source: hash;hashcat;john;detect;identify
it: hash;hashcat;john;rileva;identifica
ru: хэш;распознавание;идентификация
zh_cn: 哈希;hashcat;john;检测;识别

source: This utility lets you conveniently find out what hashing algorithm has been used on a particular string.
it: Questa utility ti consente di scoprire comodamente quale è stato l'algoritmo di hashing usato su una particolare stringa.
ru: Этот инструмент позволяет вам удобно узнать, какой алгоритм хэширования был использован для определённой строки.
zh_cn: 该应用程序可以让您方便地找出哈希值上使用了哪种散列算法。

source: Features:
it: Caratteristiche:
ru: Особенности:
zh_cn: 特点:

source: 📺 Popularity Ratings - Most popular hashes showed first.
it: 📺 Valutazioni di popolarità: gli hash più popolari vengono mostrati per primi.
ru: 📺 Рейтинги популярности - Сначала отображаются самые популярные хэши.
zh_cn: 📺 人气评级 - 优先显示最常用的哈希算法。

source: 👵 Updated! - A new hash algorithm database is used in the identification process.
it: dei processi.
ru: 👵 Обновлено! - В процессе идентификации используется новая база алгоритмов хэширования.
zh_cn: 👵 更新！- 识别过程中使用了新的哈希算法数据库。

source: hash
ru: хэш
zh_cn: 哈希

source: detect
it: rivela
ru: распознавание
zh_cn: 检测

source: identify
it: identifica
ru: идентификация
zh_cn: 识别

source: Main window with a valid hash string (Light Theme)
ru: Главное окно с подходящим хэшем (светлая тема)
zh_cn: 带有有效哈希字符串的主窗口（浅色主题）

source: Main window with a valid hash string (Dark Theme)
ru: Главное окно с подходящим хэшем (тёмная тема)
zh_cn: 带有有效哈希字符串的主窗口（深色主题）

source: Main window with a valid hash string (Small, Light Theme)
ru: Главное окно с подходящим хэшем (маленькое, cветлая тема)
zh_cn: 带有有效哈希字符串的主窗口（小窗口浅色主题）

source: Main window with a valid hash string (Small, Dark Theme)
ru: Главное окно с подходящим хэшем (маленькое, тёмная тема)
zh_cn: 带有有效哈希字符串的主窗口（小窗口深色主题）

source: Enter a hash text
it: Inserisci un testo hash
ru: Введите текст хэша
zh_cn: 输入哈希值

source: Waiting for input…
it: In attesa di input…
ru: Ожидание ввода…
zh_cn: 等待输入哈希…

source: Can't find an algorithm that matches your input!
it: Impossibile trovare un algoritmo che corrisponda al tuo input!
ru: Не удаётся найти алгоритм, соответствующий вашему вводу!
zh_cn: 找不到匹配的算法！

source: Copied
ru: Скопировано
zh_cn: 已复制

source: <b>Extended!</b>
it: <b>Esteso!</b>
ru: <b>Расширенный!</b>
zh_cn: <b>扩展!</b>

source: translator-credits
it: Albano Battistella
ru: Vladimir Kosolapov https://github.com/vmkspv
zh_cn: mdogwoop https://github.com/mdogwoop

source: External Libraries
it: Librerie Esterne
ru: Сторонние библиотеки
zh_cn: 使用的外部库
